#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: AnimBP_FlintLock_Pistol

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "FortniteGame_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass AnimBP_FlintLock_Pistol.AnimBP_FlintLock_Pistol_C
// 0x02F8 (0x0560 - 0x0268)
class UAnimBP_FlintLock_Pistol_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_78E457CD4FA347636C0E4B99073F90B7; // 0x0278(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_89B48AA240F59464A07BC7AE85623A01; // 0x0298(0x0048)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_48458F3843C60AC2FE87E880C4CE12E5; // 0x02E0(0x0078)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_1A993D864CE39B7BA0C34985C9E61D28; // 0x0358(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_8D7672404D3672B17EF1DFBF56215101; // 0x0410(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_6BD6734B44645281D411539B6AB2389D; // 0x0438(0x00B0)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_3BBD5E7C4EB7E99E66EC0A8F537242E5; // 0x04E8(0x0028)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_D22BE5844FA9E9BD82FA838E3B2A338D; // 0x0510(0x0048)()
	EFortCustomGender                             Gender;                                            // 0x0558(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_AnimBP_FlintLock_Pistol(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"AnimBP_FlintLock_Pistol_C">();
	}
	static class UAnimBP_FlintLock_Pistol_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UAnimBP_FlintLock_Pistol_C>();
	}
};

}

