#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_CreativeRadio

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_CreativeRadio.BP_CreativeRadio_C
// 0x0038 (0x0BB8 - 0x0B80)
class ABP_CreativeRadio_C final : public ABuildingPropPlaygroundMusicPlayer
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0B80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UCreative_Radio_AudioToMPC_C*           Creative_Radio_AudioToMPC;                         // 0x0B88(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UFortMinigameProgressComponent*         FortMinigameProgress;                              // 0x0B90(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class UToyOptionsComponent_C*                 ToyOptionsComponent;                               // 0x0B98(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         RadioAttenuationDistance;                          // 0x0BA0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         VolumeOverride;                                    // 0x0BA4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         CachedVolumeMultiplier;                            // 0x0BA8(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	float                                         CachedAttenuationSetting;                          // 0x0BAC(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, RepNotify, NoDestructor, HasGetValueTypeHash)
	bool                                          ShouldDriveVisualization;                          // 0x0BB0(0x0001)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, NoDestructor)
	bool                                          CachedShouldDriveVisualization;                    // 0x0BB1(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, SaveGame, IsPlainOldData, RepNotify, NoDestructor)
	bool                                          IsMeshVisibleDuringMinigame;                       // 0x0BB2(0x0001)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_BP_CreativeRadio(int32 EntryPoint);
	void BndEvt__FortMinigameProgress_K2Node_ComponentBoundEvent_3_OnMinigameStateChanged__DelegateSignature(EFortMinigameState NewMinigameState);
	void ReceiveEndPlay(EEndPlayReason EndPlayReason);
	void ReceiveBeginPlay();
	void OnPropertyChanged();
	void OnRep_CachedVolumeMultiplier();
	void OnRep_CachedAttenuationSetting();
	void OnRep_CachedShouldDriveVisualization();
	void SetAttenuationDistance();
	void UpdateCachedAttenuationSettings();
	void UpdateMinigameVisuals(EFortMinigameState MinigameState);

	class FText BlueprintGetInteractionString(const class AFortPawn* InteractingPawn) const;
	bool BlueprintCanInteract(const class AFortPawn* InteractingPawn) const;

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_CreativeRadio_C">();
	}
	static class ABP_CreativeRadio_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_CreativeRadio_C>();
	}
};

}

