#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: BP_DeimosRift_Dynamic

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "BP_DeimosRift_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass BP_DeimosRift_Dynamic.BP_DeimosRift_Dynamic_C
// 0x0030 (0x0C70 - 0x0C40)
class ABP_DeimosRift_Dynamic_C final : public ABP_DeimosRift_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_BP_DeimosRift_Dynamic_C;            // 0x0C40(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	float                                         LifeTime;                                          // 0x0C48(0x0004)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_C4C[0x4];                                      // 0x0C4C(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTimerHandle                           LifeTimeTimerHandle;                               // 0x0C50(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)
	float                                         TimeLastSetLifeTimeTimer;                          // 0x0C58(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ThrottleTime;                                      // 0x0C5C(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 GE_LifeTimeLapsed;                                 // 0x0C60(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         ServerSpawnTime;                                   // 0x0C68(0x0004)(Edit, BlueprintVisible, Net, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void UserConstructionScript();
	void ReceiveBeginPlay();
	void OnRep_ServerSpawnTime();
	void OnDamageServer(float Damage, const struct FGameplayTagContainer& DamageTags, const struct FVector& Momentum, const struct FHitResult& HitInfo, class AController* InstigatedBy, class AActor* DamageCauser, const struct FGameplayEffectContextHandle& EffectContext);
	void SetLifeTimeTimer();
	void LifeTimeExpired();
	void BP_Cosmetic_Intro();
	void BP_Cosmetic_Idle();
	void BP_Cosmetic_RampUp();
	void BP_Cosmetic_ShouldDie();
	void ExecuteUbergraph_BP_DeimosRift_Dynamic(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"BP_DeimosRift_Dynamic_C">();
	}
	static class ABP_DeimosRift_Dynamic_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ABP_DeimosRift_Dynamic_C>();
	}
};

}

