#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Creative_Background_Widget

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "Slate_structs.hpp"
#include "SlateCore_structs.hpp"


namespace SDK::Params
{

// Function Creative_Background_Widget.Creative_Background_Widget_C.ExecuteUbergraph_Creative_Background_Widget
// 0x0004 (0x0004 - 0x0000)
struct Creative_Background_Widget_C_ExecuteUbergraph_Creative_Background_Widget final
{
public:
	int32                                         EntryPoint;                                        // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Creative_Background_Widget.Creative_Background_Widget_C.SetText
// 0x0028 (0x0028 - 0x0000)
struct Creative_Background_Widget_C_SetText final
{
public:
	class FString                                 Text;                                              // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, HasGetValueTypeHash)
	class FText                                   CallFunc_Conv_StringToText_ReturnValue;            // 0x0010(0x0018)()
};

// Function Creative_Background_Widget.Creative_Background_Widget_C.SetBackgroundColor
// 0x0010 (0x0010 - 0x0000)
struct Creative_Background_Widget_C_SetBackgroundColor final
{
public:
	struct FLinearColor                           Color;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Creative_Background_Widget.Creative_Background_Widget_C.SetTextScale
// 0x0058 (0x0058 - 0x0000)
struct Creative_Background_Widget_C_SetTextScale final
{
public:
	int32                                         FontSize;                                          // 0x0000(0x0004)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	struct FSlateFontInfo                         K2Node_MakeStruct_SlateFontInfo;                   // 0x0008(0x0050)(HasGetValueTypeHash)
};

// Function Creative_Background_Widget.Creative_Background_Widget_C.SetTextAlignment
// 0x0001 (0x0001 - 0x0000)
struct Creative_Background_Widget_C_SetTextAlignment final
{
public:
	ETextJustify                                  Alignment;                                         // 0x0000(0x0001)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function Creative_Background_Widget.Creative_Background_Widget_C.SetTextColor
// 0x0038 (0x0038 - 0x0000)
struct Creative_Background_Widget_C_SetTextColor final
{
public:
	struct FLinearColor                           TextColor;                                         // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FSlateColor                            K2Node_MakeStruct_SlateColor;                      // 0x0010(0x0028)()
};

}

