#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Creative_Powerup_Grind

#include "Basic.hpp"

#include "GameplayAbilities_structs.hpp"


namespace SDK::Params
{

// Function Creative_Powerup_Grind.Creative_Powerup_Grind_C.SetupEffectData
// 0x0050 (0x0050 - 0x0000)
struct Creative_Powerup_Grind_C_SetupEffectData final
{
public:
	struct FGameplayEffectSpecHandle              EffectHandle;                                      // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm)
	struct FGameplayEffectSpecHandle              OutEffectHandle;                                   // 0x0010(0x0010)(Parm, OutParm)
	struct FGameplayEffectSpecHandle              LocalEffectHandleRef;                              // 0x0020(0x0010)(Edit, BlueprintVisible)
	struct FGameplayEffectSpecHandle              CallFunc_SetupEffectData_OutEffectHandle;          // 0x0030(0x0010)()
	struct FGameplayEffectSpecHandle              CallFunc_AddAssetTag_ReturnValue;                  // 0x0040(0x0010)()
};

}

