#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: Frontend_HeroLoadout

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// BlueprintGeneratedClass Frontend_HeroLoadout.Frontend_HeroLoadout_C
// 0x0088 (0x02E0 - 0x0258)
class AFrontend_HeroLoadout_C final : public AFortLevelScriptActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0258(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FTransform                             Transform___HeroLoadOut;                           // 0x0260(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             Transform___Command;                               // 0x0290(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class AHeroLoadoutItemPedestal_C*             HL_Pedestal;                                       // 0x02C0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 Command_Pedestal_Placement_ExecuteUbergraph_Frontend_HeroLoadout_RefProperty; // 0x02C8(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AActor*                                 HeroLoadout_Pedestal_Placement_ExecuteUbergraph_Frontend_HeroLoadout_RefProperty; // 0x02D0(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_Frontend_HeroLoadout(int32 EntryPoint);
	void HandleFrontendCameraChanged(EFrontEndCamera NewCamera, EFrontEndCamera OldCamera);
	void Command___Transform();
	void HeroLoadout___Transfrom();
	void ReceiveBeginPlay();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"Frontend_HeroLoadout_C">();
	}
	static class AFrontend_HeroLoadout_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AFrontend_HeroLoadout_C>();
	}
};

}

