#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Perk_H_FeelTheBASE_DeathListener

#include "Basic.hpp"

#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "GAT_GenericTriggeredAbility_Perk_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Perk_H_FeelTheBASE_DeathListener.GA_Perk_H_FeelTheBASE_DeathListener_C
// 0x0048 (0x0AC8 - 0x0A80)
class UGA_Perk_H_FeelTheBASE_DeathListener_C final : public UGAT_GenericTriggeredAbility_Perk_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Perk_H_FeelTheBASE_DeathListener_C; // 0x0A80(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FGameplayTagContainer                  TC_Overflow;                                       // 0x0A88(0x0020)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 StackCount;                                        // 0x0AA8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack1;                                            // 0x0AB0(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack2;                                            // 0x0AB4(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         Stack3;                                            // 0x0AB8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTag                           DeathCue;                                          // 0x0ABC(0x0008)(Edit, BlueprintVisible, DisableEditOnInstance, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Perk_H_FeelTheBASE_DeathListener(int32 EntryPoint);
	void K2_ActivateAbilityFromEvent(const struct FGameplayEventData& EventData_0);
	void ExecuteGC(class AB_Perk_C_Constructor_BASE_C* BaseReference, bool* Overflow);
	void ActivateBaseStacks(int32 Stack_Count, class AB_Perk_C_Constructor_BASE_C* BaseReference);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Perk_H_FeelTheBASE_DeathListener_C">();
	}
	static class UGA_Perk_H_FeelTheBASE_DeathListener_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Perk_H_FeelTheBASE_DeathListener_C>();
	}
};

}

