#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: GA_Trap_PoisonDarts

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "GA_TrapGeneric_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass GA_Trap_PoisonDarts.GA_Trap_PoisonDarts_C
// 0x00A8 (0x0A18 - 0x0970)
class UGA_Trap_PoisonDarts_C final : public UGA_TrapGeneric_C
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame_GA_Trap_PoisonDarts_C;              // 0x0970(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FFortGameplayEffectContainerSpec       GameplayEffectSpec;                                // 0x0978(0x0088)(Edit, BlueprintVisible, DisableEditOnInstance)
	class UClass*                                 DartPrjClass;                                      // 0x0A00(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABP_PoisonDartTrap_Floor_C*             FloorDartsTrap;                                    // 0x0A08(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         Individual_Proj_Delay;                             // 0x0A10(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_GA_Trap_PoisonDarts(int32 EntryPoint);
	void K2_ActivateAbility();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"GA_Trap_PoisonDarts_C">();
	}
	static class UGA_Trap_PoisonDarts_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UGA_Trap_PoisonDarts_C>();
	}
};

}

