#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: HeroLoadoutItemPedestal

#include "Basic.hpp"

#include "CoreUObject_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "Engine_structs.hpp"
#include "FortniteUI_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass HeroLoadoutItemPedestal.HeroLoadoutItemPedestal_C
// 0x00C0 (0x0400 - 0x0340)
class AHeroLoadoutItemPedestal_C final : public AFortHeroLoadoutPedestal
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0340(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UArrowComponent*                        Arrow;                                             // 0x0348(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	struct FGameplayTagQuery                      AnimationTagQuery_Idle;                            // 0x0350(0x0048)(Edit, BlueprintVisible, ExposeOnSpawn)
	uint8                                         Pad_398[0x8];                                      // 0x0398(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FTransform                             CommandScreenTransform;                            // 0x03A0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	struct FTransform                             HeroLoadoutScreenTransform;                        // 0x03D0(0x0030)(Edit, BlueprintVisible, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_HeroLoadoutItemPedestal(int32 EntryPoint);
	void HandleSlotFocusInUIChanged();
	void OnHeroPawnSetupCompleted();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"HeroLoadoutItemPedestal_C">();
	}
	static class AHeroLoadoutItemPedestal_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AHeroLoadoutItemPedestal_C>();
	}
};

}

