#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: ItemInspectScreen

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "FortniteGame_structs.hpp"
#include "CommonUI_structs.hpp"
#include "GameplayTags_structs.hpp"
#include "UMG_structs.hpp"
#include "FortniteUI_structs.hpp"


namespace SDK::Params
{

// Function ItemInspectScreen.ItemInspectScreen_C.HandleVaultItemsViewed
// 0x0040 (0x0040 - 0x0000)
struct ItemInspectScreen_C_HandleVaultItemsViewed final
{
public:
	TArray<class UFortItem*>                      Items;                                             // 0x0000(0x0010)(BlueprintVisible, BlueprintReadOnly, Parm, OutParm, ZeroConstructor, ReferenceParm)
	class UFortFrontEndContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawn*                        CallFunc_GetHeroPlayerPawnForCurrentDisplayedItem_ReturnValue; // 0x0018(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TScriptInterface<class ICustomCharacterPartOwnerInterface> K2Node_DynamicCast_AsCustom_Character_Part_Owner_Interface; // 0x0028(0x0010)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ItemInspectScreen.ItemInspectScreen_C.GetRefundHelpActions
// 0x01D0 (0x01D0 - 0x0000)
struct ItemInspectScreen_C_GetRefundHelpActions final
{
public:
	TArray<struct FConfirmationDialogAction>      ConfirmActions;                                    // 0x0000(0x0010)(Parm, OutParm, ZeroConstructor)
	class FName                                   DeclineAction;                                     // 0x0010(0x0008)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	TArray<struct FConfirmationDialogAction>      ConfirmActionList;                                 // 0x0018(0x0010)(Edit, BlueprintVisible, ZeroConstructor)
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0028(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction;        // 0x0030(0x00C8)()
	bool                                          CallFunc_GetHideStwItemRefundHelp_ReturnValue;     // 0x00F8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_F9[0x3];                                       // 0x00F9(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         CallFunc_Array_Add_ReturnValue;                    // 0x00FC(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FConfirmationDialogAction              K2Node_MakeStruct_ConfirmationDialogAction_1;      // 0x0100(0x00C8)()
	int32                                         CallFunc_Array_Add_ReturnValue_1;                  // 0x01C8(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemInspectScreen.ItemInspectScreen_C.ShouldShowRefundMessage
// 0x0068 (0x0068 - 0x0000)
struct ItemInspectScreen_C_ShouldShowRefundMessage final
{
public:
	bool                                          ShouldShowRefundMessage_0;                         // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   RefundDescriptionText;                             // 0x0008(0x0018)(Parm, OutParm)
	class FText                                   RefundDescription;                                 // 0x0020(0x0018)(Edit, BlueprintVisible)
	class FText                                   CallFunc_GetRefundDescriptionText_ReturnValue;     // 0x0038(0x0018)()
	bool                                          CallFunc_TextIsEmpty_ReturnValue;                  // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_51[0x7];                                       // 0x0051(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortAccountItem*                       K2Node_DynamicCast_AsFort_Account_Item;            // 0x0058(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0060(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRefundable_ReturnValue;                 // 0x0061(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ItemInspectScreen.ItemInspectScreen_C.ShowRefundConfirmationModalWidget
// 0x0040 (0x0040 - 0x0000)
struct ItemInspectScreen_C_ShowRefundConfirmationModalWidget final
{
public:
	class UFortAccountItem*                       CallFunc_GetRefundResultItem_ReturnValue;          // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       K2Node_DynamicCast_AsFort_Account_Item;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0010(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_11[0x7];                                       // 0x0011(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0018(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRefundable_ReturnValue;                 // 0x0020(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_21[0x7];                                       // 0x0021(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0028(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemInspectRefundConfirmationModalWidget_C* K2Node_DynamicCast_AsItem_Inspect_Refund_Confirmation_Modal_Widget; // 0x0030(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess_1;                     // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ItemInspectScreen.ItemInspectScreen_C.GetRefundPopupInputActionState
// 0x0020 (0x0020 - 0x0000)
struct ItemInspectScreen_C_GetRefundPopupInputActionState final
{
public:
	EInputActionState                             State;                                             // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          Temp_bool_Variable;                                // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             Temp_byte_Variable;                                // 0x0002(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EInputActionState                             Temp_byte_Variable_1;                              // 0x0003(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_4[0x4];                                        // 0x0004(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortAccountItem*                       K2Node_DynamicCast_AsFort_Account_Item;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsItemSlottedInCollectionBook_ReturnValue; // 0x0019(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsRefundable_ReturnValue;                 // 0x001A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x001B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x001C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x001D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	EInputActionState                             K2Node_Select_Default;                             // 0x001E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
};

// Function ItemInspectScreen.ItemInspectScreen_C.ShowRefundHelpIfNecessary
// 0x0030 (0x0030 - 0x0000)
struct ItemInspectScreen_C_ShowRefundHelpIfNecessary final
{
public:
	class UFortRuntimeOptions*                    CallFunc_GetRuntimeOptions_ReturnValue;            // 0x0000(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0008(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_9[0x7];                                        // 0x0009(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortAccountItem*                       K2Node_DynamicCast_AsFort_Account_Item;            // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_IsRefundable_ReturnValue;                 // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_GetHideStwItemRefundHelp_ReturnValue;     // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsActivated_ReturnValue;                  // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ItemInspectScreen.ItemInspectScreen_C.CreateRefundPopupMenu
// 0x0020 (0x0020 - 0x0000)
struct ItemInspectScreen_C_CreateRefundPopupMenu final
{
public:
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x0000(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x0008(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UItemInspectRefundPopupMenu_C*          K2Node_DynamicCast_AsItem_Inspect_Refund_Popup_Menu; // 0x0010(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ItemInspectScreen.ItemInspectScreen_C.HandleRefundPopup
// 0x0001 (0x0001 - 0x0000)
struct ItemInspectScreen_C_HandleRefundPopup final
{
public:
	bool                                          bPassThrough;                                      // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ItemInspectScreen.ItemInspectScreen_C.HandleShowUpgradeTutorial
// 0x1BD0 (0x1BD0 - 0x0000)
struct ItemInspectScreen_C_HandleShowUpgradeTutorial final
{
public:
	class FText                                   Temp_text_Variable;                                // 0x0000(0x0018)()
	class FText                                   Temp_text_Variable_1;                              // 0x0018(0x0018)()
	class FText                                   Temp_text_Variable_2;                              // 0x0030(0x0018)()
	class FText                                   Temp_text_Variable_3;                              // 0x0048(0x0018)()
	class FText                                   Temp_text_Variable_4;                              // 0x0060(0x0018)()
	class FText                                   Temp_text_Variable_5;                              // 0x0078(0x0018)()
	class FText                                   Temp_text_Variable_6;                              // 0x0090(0x0018)()
	class FText                                   Temp_text_Variable_7;                              // 0x00A8(0x0018)()
	class FText                                   Temp_text_Variable_8;                              // 0x00C0(0x0018)()
	class FText                                   Temp_text_Variable_9;                              // 0x00D8(0x0018)()
	class FText                                   Temp_text_Variable_10;                             // 0x00F0(0x0018)()
	class FText                                   Temp_text_Variable_11;                             // 0x0108(0x0018)()
	class FText                                   Temp_text_Variable_12;                             // 0x0120(0x0018)()
	class FText                                   Temp_text_Variable_13;                             // 0x0138(0x0018)()
	class FText                                   Temp_text_Variable_14;                             // 0x0150(0x0018)()
	class FText                                   Temp_text_Variable_15;                             // 0x0168(0x0018)()
	class FText                                   Temp_text_Variable_16;                             // 0x0180(0x0018)()
	class FText                                   Temp_text_Variable_17;                             // 0x0198(0x0018)()
	class FText                                   Temp_text_Variable_18;                             // 0x01B0(0x0018)()
	class FText                                   Temp_text_Variable_19;                             // 0x01C8(0x0018)()
	class FText                                   Temp_text_Variable_20;                             // 0x01E0(0x0018)()
	class FText                                   Temp_text_Variable_21;                             // 0x01F8(0x0018)()
	class FText                                   Temp_text_Variable_22;                             // 0x0210(0x0018)()
	class FText                                   Temp_text_Variable_23;                             // 0x0228(0x0018)()
	class FText                                   Temp_text_Variable_24;                             // 0x0240(0x0018)()
	class FText                                   Temp_text_Variable_25;                             // 0x0258(0x0018)()
	class FText                                   Temp_text_Variable_26;                             // 0x0270(0x0018)()
	class FText                                   Temp_text_Variable_27;                             // 0x0288(0x0018)()
	class FText                                   Temp_text_Variable_28;                             // 0x02A0(0x0018)()
	class FText                                   Temp_text_Variable_29;                             // 0x02B8(0x0018)()
	class FText                                   Temp_text_Variable_30;                             // 0x02D0(0x0018)()
	class FText                                   Temp_text_Variable_31;                             // 0x02E8(0x0018)()
	class FText                                   Temp_text_Variable_32;                             // 0x0300(0x0018)()
	class FText                                   Temp_text_Variable_33;                             // 0x0318(0x0018)()
	class FText                                   Temp_text_Variable_34;                             // 0x0330(0x0018)()
	class FText                                   Temp_text_Variable_35;                             // 0x0348(0x0018)()
	class FText                                   Temp_text_Variable_36;                             // 0x0360(0x0018)()
	class FText                                   Temp_text_Variable_37;                             // 0x0378(0x0018)()
	class FText                                   Temp_text_Variable_38;                             // 0x0390(0x0018)()
	class FText                                   Temp_text_Variable_39;                             // 0x03A8(0x0018)()
	class FText                                   Temp_text_Variable_40;                             // 0x03C0(0x0018)()
	class FText                                   Temp_text_Variable_41;                             // 0x03D8(0x0018)()
	class FText                                   Temp_text_Variable_42;                             // 0x03F0(0x0018)()
	class FText                                   Temp_text_Variable_43;                             // 0x0408(0x0018)()
	class FText                                   Temp_text_Variable_44;                             // 0x0420(0x0018)()
	class FText                                   Temp_text_Variable_45;                             // 0x0438(0x0018)()
	class FText                                   Temp_text_Variable_46;                             // 0x0450(0x0018)()
	class FText                                   Temp_text_Variable_47;                             // 0x0468(0x0018)()
	class FText                                   Temp_text_Variable_48;                             // 0x0480(0x0018)()
	class FText                                   Temp_text_Variable_49;                             // 0x0498(0x0018)()
	class FText                                   Temp_text_Variable_50;                             // 0x04B0(0x0018)()
	class FText                                   Temp_text_Variable_51;                             // 0x04C8(0x0018)()
	class FText                                   Temp_text_Variable_52;                             // 0x04E0(0x0018)()
	class FText                                   Temp_text_Variable_53;                             // 0x04F8(0x0018)()
	class FText                                   Temp_text_Variable_54;                             // 0x0510(0x0018)()
	class FText                                   Temp_text_Variable_55;                             // 0x0528(0x0018)()
	class FText                                   Temp_text_Variable_56;                             // 0x0540(0x0018)()
	class FText                                   Temp_text_Variable_57;                             // 0x0558(0x0018)()
	class FText                                   Temp_text_Variable_58;                             // 0x0570(0x0018)()
	class FText                                   Temp_text_Variable_59;                             // 0x0588(0x0018)()
	class FText                                   Temp_text_Variable_60;                             // 0x05A0(0x0018)()
	class FText                                   Temp_text_Variable_61;                             // 0x05B8(0x0018)()
	class FText                                   Temp_text_Variable_62;                             // 0x05D0(0x0018)()
	class FText                                   Temp_text_Variable_63;                             // 0x05E8(0x0018)()
	class FText                                   Temp_text_Variable_64;                             // 0x0600(0x0018)()
	class FText                                   Temp_text_Variable_65;                             // 0x0618(0x0018)()
	class FText                                   Temp_text_Variable_66;                             // 0x0630(0x0018)()
	class FText                                   Temp_text_Variable_67;                             // 0x0648(0x0018)()
	class FText                                   Temp_text_Variable_68;                             // 0x0660(0x0018)()
	class FText                                   Temp_text_Variable_69;                             // 0x0678(0x0018)()
	class FText                                   Temp_text_Variable_70;                             // 0x0690(0x0018)()
	class FText                                   Temp_text_Variable_71;                             // 0x06A8(0x0018)()
	class FText                                   Temp_text_Variable_72;                             // 0x06C0(0x0018)()
	class FText                                   Temp_text_Variable_73;                             // 0x06D8(0x0018)()
	class FText                                   Temp_text_Variable_74;                             // 0x06F0(0x0018)()
	class FText                                   Temp_text_Variable_75;                             // 0x0708(0x0018)()
	class FText                                   Temp_text_Variable_76;                             // 0x0720(0x0018)()
	class FText                                   Temp_text_Variable_77;                             // 0x0738(0x0018)()
	class FText                                   Temp_text_Variable_78;                             // 0x0750(0x0018)()
	class FText                                   Temp_text_Variable_79;                             // 0x0768(0x0018)()
	class FText                                   Temp_text_Variable_80;                             // 0x0780(0x0018)()
	class FText                                   Temp_text_Variable_81;                             // 0x0798(0x0018)()
	class FText                                   Temp_text_Variable_82;                             // 0x07B0(0x0018)()
	class FText                                   Temp_text_Variable_83;                             // 0x07C8(0x0018)()
	class FText                                   Temp_text_Variable_84;                             // 0x07E0(0x0018)()
	class FText                                   Temp_text_Variable_85;                             // 0x07F8(0x0018)()
	class FText                                   Temp_text_Variable_86;                             // 0x0810(0x0018)()
	class FText                                   Temp_text_Variable_87;                             // 0x0828(0x0018)()
	EFortItemType                                 Temp_byte_Variable;                                // 0x0840(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_841[0x7];                                      // 0x0841(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   Temp_text_Variable_88;                             // 0x0848(0x0018)()
	class FText                                   Temp_text_Variable_89;                             // 0x0860(0x0018)()
	class FText                                   Temp_text_Variable_90;                             // 0x0878(0x0018)()
	class FText                                   Temp_text_Variable_91;                             // 0x0890(0x0018)()
	class FText                                   Temp_text_Variable_92;                             // 0x08A8(0x0018)()
	class FText                                   Temp_text_Variable_93;                             // 0x08C0(0x0018)()
	class FText                                   Temp_text_Variable_94;                             // 0x08D8(0x0018)()
	class FText                                   Temp_text_Variable_95;                             // 0x08F0(0x0018)()
	class FText                                   Temp_text_Variable_96;                             // 0x0908(0x0018)()
	class FText                                   Temp_text_Variable_97;                             // 0x0920(0x0018)()
	class FText                                   Temp_text_Variable_98;                             // 0x0938(0x0018)()
	class FText                                   Temp_text_Variable_99;                             // 0x0950(0x0018)()
	class FText                                   Temp_text_Variable_100;                            // 0x0968(0x0018)()
	class FText                                   Temp_text_Variable_101;                            // 0x0980(0x0018)()
	class FText                                   Temp_text_Variable_102;                            // 0x0998(0x0018)()
	class FText                                   Temp_text_Variable_103;                            // 0x09B0(0x0018)()
	class FText                                   Temp_text_Variable_104;                            // 0x09C8(0x0018)()
	class FText                                   Temp_text_Variable_105;                            // 0x09E0(0x0018)()
	class FText                                   Temp_text_Variable_106;                            // 0x09F8(0x0018)()
	class FText                                   Temp_text_Variable_107;                            // 0x0A10(0x0018)()
	class FText                                   Temp_text_Variable_108;                            // 0x0A28(0x0018)()
	class FText                                   Temp_text_Variable_109;                            // 0x0A40(0x0018)()
	class FText                                   Temp_text_Variable_110;                            // 0x0A58(0x0018)()
	class FText                                   Temp_text_Variable_111;                            // 0x0A70(0x0018)()
	class FText                                   Temp_text_Variable_112;                            // 0x0A88(0x0018)()
	class FText                                   Temp_text_Variable_113;                            // 0x0AA0(0x0018)()
	class FText                                   Temp_text_Variable_114;                            // 0x0AB8(0x0018)()
	class FText                                   Temp_text_Variable_115;                            // 0x0AD0(0x0018)()
	class FText                                   Temp_text_Variable_116;                            // 0x0AE8(0x0018)()
	class FText                                   Temp_text_Variable_117;                            // 0x0B00(0x0018)()
	class FText                                   Temp_text_Variable_118;                            // 0x0B18(0x0018)()
	class FText                                   Temp_text_Variable_119;                            // 0x0B30(0x0018)()
	class FText                                   Temp_text_Variable_120;                            // 0x0B48(0x0018)()
	class FText                                   Temp_text_Variable_121;                            // 0x0B60(0x0018)()
	class FText                                   Temp_text_Variable_122;                            // 0x0B78(0x0018)()
	class FText                                   Temp_text_Variable_123;                            // 0x0B90(0x0018)()
	class FText                                   Temp_text_Variable_124;                            // 0x0BA8(0x0018)()
	class FText                                   Temp_text_Variable_125;                            // 0x0BC0(0x0018)()
	class FText                                   Temp_text_Variable_126;                            // 0x0BD8(0x0018)()
	class FText                                   Temp_text_Variable_127;                            // 0x0BF0(0x0018)()
	class FText                                   Temp_text_Variable_128;                            // 0x0C08(0x0018)()
	class FText                                   Temp_text_Variable_129;                            // 0x0C20(0x0018)()
	class FText                                   Temp_text_Variable_130;                            // 0x0C38(0x0018)()
	class FText                                   Temp_text_Variable_131;                            // 0x0C50(0x0018)()
	class FText                                   Temp_text_Variable_132;                            // 0x0C68(0x0018)()
	class FText                                   Temp_text_Variable_133;                            // 0x0C80(0x0018)()
	class FText                                   Temp_text_Variable_134;                            // 0x0C98(0x0018)()
	class FText                                   Temp_text_Variable_135;                            // 0x0CB0(0x0018)()
	class FText                                   Temp_text_Variable_136;                            // 0x0CC8(0x0018)()
	class FText                                   Temp_text_Variable_137;                            // 0x0CE0(0x0018)()
	class FText                                   Temp_text_Variable_138;                            // 0x0CF8(0x0018)()
	class FText                                   Temp_text_Variable_139;                            // 0x0D10(0x0018)()
	class FText                                   Temp_text_Variable_140;                            // 0x0D28(0x0018)()
	class FText                                   Temp_text_Variable_141;                            // 0x0D40(0x0018)()
	class FText                                   Temp_text_Variable_142;                            // 0x0D58(0x0018)()
	class FText                                   Temp_text_Variable_143;                            // 0x0D70(0x0018)()
	class FText                                   Temp_text_Variable_144;                            // 0x0D88(0x0018)()
	class FText                                   Temp_text_Variable_145;                            // 0x0DA0(0x0018)()
	class FText                                   Temp_text_Variable_146;                            // 0x0DB8(0x0018)()
	class FText                                   Temp_text_Variable_147;                            // 0x0DD0(0x0018)()
	class FText                                   Temp_text_Variable_148;                            // 0x0DE8(0x0018)()
	class FText                                   Temp_text_Variable_149;                            // 0x0E00(0x0018)()
	class FText                                   Temp_text_Variable_150;                            // 0x0E18(0x0018)()
	class FText                                   Temp_text_Variable_151;                            // 0x0E30(0x0018)()
	class FText                                   Temp_text_Variable_152;                            // 0x0E48(0x0018)()
	class FText                                   Temp_text_Variable_153;                            // 0x0E60(0x0018)()
	class FText                                   Temp_text_Variable_154;                            // 0x0E78(0x0018)()
	class FText                                   Temp_text_Variable_155;                            // 0x0E90(0x0018)()
	class FText                                   Temp_text_Variable_156;                            // 0x0EA8(0x0018)()
	class FText                                   Temp_text_Variable_157;                            // 0x0EC0(0x0018)()
	class FText                                   Temp_text_Variable_158;                            // 0x0ED8(0x0018)()
	class FText                                   Temp_text_Variable_159;                            // 0x0EF0(0x0018)()
	class FText                                   Temp_text_Variable_160;                            // 0x0F08(0x0018)()
	class FText                                   Temp_text_Variable_161;                            // 0x0F20(0x0018)()
	class FText                                   Temp_text_Variable_162;                            // 0x0F38(0x0018)()
	class FText                                   Temp_text_Variable_163;                            // 0x0F50(0x0018)()
	class FText                                   Temp_text_Variable_164;                            // 0x0F68(0x0018)()
	class FText                                   Temp_text_Variable_165;                            // 0x0F80(0x0018)()
	class FText                                   Temp_text_Variable_166;                            // 0x0F98(0x0018)()
	class FText                                   Temp_text_Variable_167;                            // 0x0FB0(0x0018)()
	class FText                                   Temp_text_Variable_168;                            // 0x0FC8(0x0018)()
	class FText                                   Temp_text_Variable_169;                            // 0x0FE0(0x0018)()
	class FText                                   Temp_text_Variable_170;                            // 0x0FF8(0x0018)()
	class FText                                   Temp_text_Variable_171;                            // 0x1010(0x0018)()
	class FText                                   Temp_text_Variable_172;                            // 0x1028(0x0018)()
	class FText                                   Temp_text_Variable_173;                            // 0x1040(0x0018)()
	class FText                                   Temp_text_Variable_174;                            // 0x1058(0x0018)()
	class FText                                   Temp_text_Variable_175;                            // 0x1070(0x0018)()
	class FText                                   Temp_text_Variable_176;                            // 0x1088(0x0018)()
	class FText                                   Temp_text_Variable_177;                            // 0x10A0(0x0018)()
	class FText                                   Temp_text_Variable_178;                            // 0x10B8(0x0018)()
	class FText                                   Temp_text_Variable_179;                            // 0x10D0(0x0018)()
	class FText                                   Temp_text_Variable_180;                            // 0x10E8(0x0018)()
	EFortItemType                                 Temp_byte_Variable_1;                              // 0x1100(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1101[0x7];                                     // 0x1101(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   Temp_text_Variable_181;                            // 0x1108(0x0018)()
	class FText                                   Temp_text_Variable_182;                            // 0x1120(0x0018)()
	class FText                                   Temp_text_Variable_183;                            // 0x1138(0x0018)()
	class FText                                   Temp_text_Variable_184;                            // 0x1150(0x0018)()
	class FText                                   Temp_text_Variable_185;                            // 0x1168(0x0018)()
	class FText                                   Temp_text_Variable_186;                            // 0x1180(0x0018)()
	class FText                                   Temp_text_Variable_187;                            // 0x1198(0x0018)()
	class FText                                   Temp_text_Variable_188;                            // 0x11B0(0x0018)()
	class FText                                   Temp_text_Variable_189;                            // 0x11C8(0x0018)()
	class FText                                   Temp_text_Variable_190;                            // 0x11E0(0x0018)()
	class FText                                   Temp_text_Variable_191;                            // 0x11F8(0x0018)()
	class FText                                   Temp_text_Variable_192;                            // 0x1210(0x0018)()
	class FText                                   Temp_text_Variable_193;                            // 0x1228(0x0018)()
	class FText                                   Temp_text_Variable_194;                            // 0x1240(0x0018)()
	class FText                                   Temp_text_Variable_195;                            // 0x1258(0x0018)()
	class FText                                   Temp_text_Variable_196;                            // 0x1270(0x0018)()
	class FText                                   Temp_text_Variable_197;                            // 0x1288(0x0018)()
	class FText                                   Temp_text_Variable_198;                            // 0x12A0(0x0018)()
	class FText                                   Temp_text_Variable_199;                            // 0x12B8(0x0018)()
	class FText                                   Temp_text_Variable_200;                            // 0x12D0(0x0018)()
	class FText                                   Temp_text_Variable_201;                            // 0x12E8(0x0018)()
	class FText                                   Temp_text_Variable_202;                            // 0x1300(0x0018)()
	class FText                                   Temp_text_Variable_203;                            // 0x1318(0x0018)()
	class FText                                   Temp_text_Variable_204;                            // 0x1330(0x0018)()
	class FText                                   Temp_text_Variable_205;                            // 0x1348(0x0018)()
	class FText                                   Temp_text_Variable_206;                            // 0x1360(0x0018)()
	class FText                                   Temp_text_Variable_207;                            // 0x1378(0x0018)()
	class FText                                   Temp_text_Variable_208;                            // 0x1390(0x0018)()
	class FText                                   Temp_text_Variable_209;                            // 0x13A8(0x0018)()
	class FText                                   Temp_text_Variable_210;                            // 0x13C0(0x0018)()
	class FText                                   Temp_text_Variable_211;                            // 0x13D8(0x0018)()
	class FText                                   Temp_text_Variable_212;                            // 0x13F0(0x0018)()
	class FText                                   Temp_text_Variable_213;                            // 0x1408(0x0018)()
	class FText                                   Temp_text_Variable_214;                            // 0x1420(0x0018)()
	class FText                                   Temp_text_Variable_215;                            // 0x1438(0x0018)()
	class FText                                   Temp_text_Variable_216;                            // 0x1450(0x0018)()
	class FText                                   Temp_text_Variable_217;                            // 0x1468(0x0018)()
	class FText                                   Temp_text_Variable_218;                            // 0x1480(0x0018)()
	class FText                                   Temp_text_Variable_219;                            // 0x1498(0x0018)()
	class FText                                   Temp_text_Variable_220;                            // 0x14B0(0x0018)()
	class FText                                   Temp_text_Variable_221;                            // 0x14C8(0x0018)()
	class FText                                   Temp_text_Variable_222;                            // 0x14E0(0x0018)()
	class FText                                   Temp_text_Variable_223;                            // 0x14F8(0x0018)()
	class FText                                   Temp_text_Variable_224;                            // 0x1510(0x0018)()
	class FText                                   Temp_text_Variable_225;                            // 0x1528(0x0018)()
	class FText                                   Temp_text_Variable_226;                            // 0x1540(0x0018)()
	class FText                                   Temp_text_Variable_227;                            // 0x1558(0x0018)()
	class FText                                   Temp_text_Variable_228;                            // 0x1570(0x0018)()
	class FText                                   Temp_text_Variable_229;                            // 0x1588(0x0018)()
	class FText                                   Temp_text_Variable_230;                            // 0x15A0(0x0018)()
	class FText                                   Temp_text_Variable_231;                            // 0x15B8(0x0018)()
	class FText                                   Temp_text_Variable_232;                            // 0x15D0(0x0018)()
	class FText                                   Temp_text_Variable_233;                            // 0x15E8(0x0018)()
	class FText                                   Temp_text_Variable_234;                            // 0x1600(0x0018)()
	class FText                                   Temp_text_Variable_235;                            // 0x1618(0x0018)()
	class FText                                   Temp_text_Variable_236;                            // 0x1630(0x0018)()
	class FText                                   Temp_text_Variable_237;                            // 0x1648(0x0018)()
	class FText                                   Temp_text_Variable_238;                            // 0x1660(0x0018)()
	class FText                                   Temp_text_Variable_239;                            // 0x1678(0x0018)()
	class FText                                   Temp_text_Variable_240;                            // 0x1690(0x0018)()
	class FText                                   Temp_text_Variable_241;                            // 0x16A8(0x0018)()
	class FText                                   Temp_text_Variable_242;                            // 0x16C0(0x0018)()
	class FText                                   Temp_text_Variable_243;                            // 0x16D8(0x0018)()
	class FText                                   Temp_text_Variable_244;                            // 0x16F0(0x0018)()
	class FText                                   Temp_text_Variable_245;                            // 0x1708(0x0018)()
	class FText                                   Temp_text_Variable_246;                            // 0x1720(0x0018)()
	class FText                                   Temp_text_Variable_247;                            // 0x1738(0x0018)()
	class FText                                   Temp_text_Variable_248;                            // 0x1750(0x0018)()
	class FText                                   Temp_text_Variable_249;                            // 0x1768(0x0018)()
	class FText                                   Temp_text_Variable_250;                            // 0x1780(0x0018)()
	class FText                                   Temp_text_Variable_251;                            // 0x1798(0x0018)()
	class FText                                   Temp_text_Variable_252;                            // 0x17B0(0x0018)()
	class FText                                   Temp_text_Variable_253;                            // 0x17C8(0x0018)()
	class FText                                   Temp_text_Variable_254;                            // 0x17E0(0x0018)()
	class FText                                   Temp_text_Variable_255;                            // 0x17F8(0x0018)()
	class FText                                   Temp_text_Variable_256;                            // 0x1810(0x0018)()
	class FText                                   Temp_text_Variable_257;                            // 0x1828(0x0018)()
	class FText                                   Temp_text_Variable_258;                            // 0x1840(0x0018)()
	class FText                                   Temp_text_Variable_259;                            // 0x1858(0x0018)()
	class FText                                   Temp_text_Variable_260;                            // 0x1870(0x0018)()
	class FText                                   Temp_text_Variable_261;                            // 0x1888(0x0018)()
	class FText                                   Temp_text_Variable_262;                            // 0x18A0(0x0018)()
	class FText                                   Temp_text_Variable_263;                            // 0x18B8(0x0018)()
	class FText                                   Temp_text_Variable_264;                            // 0x18D0(0x0018)()
	class FText                                   Temp_text_Variable_265;                            // 0x18E8(0x0018)()
	class FText                                   Temp_text_Variable_266;                            // 0x1900(0x0018)()
	class FText                                   Temp_text_Variable_267;                            // 0x1918(0x0018)()
	class FText                                   Temp_text_Variable_268;                            // 0x1930(0x0018)()
	class FText                                   Temp_text_Variable_269;                            // 0x1948(0x0018)()
	class FText                                   Temp_text_Variable_270;                            // 0x1960(0x0018)()
	class FText                                   Temp_text_Variable_271;                            // 0x1978(0x0018)()
	class FText                                   Temp_text_Variable_272;                            // 0x1990(0x0018)()
	class FText                                   Temp_text_Variable_273;                            // 0x19A8(0x0018)()
	class FText                                   Temp_text_Variable_274;                            // 0x19C0(0x0018)()
	class FText                                   Temp_text_Variable_275;                            // 0x19D8(0x0018)()
	EFortItemType                                 Temp_byte_Variable_2;                              // 0x19F0(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19F1[0x7];                                     // 0x19F1(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   Temp_text_Variable_276;                            // 0x19F8(0x0018)()
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x1A10(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_1A11[0x7];                                     // 0x1A11(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   K2Node_Select_Default;                             // 0x1A18(0x0018)()
	class FText                                   K2Node_Select_Default_1;                           // 0x1A30(0x0018)()
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData;              // 0x1A48(0x0040)(HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_1;            // 0x1A88(0x0040)(HasGetValueTypeHash)
	TArray<TSoftObjectPtr<class UTexture2D>>      K2Node_MakeArray_Array;                            // 0x1AC8(0x0010)(ZeroConstructor, ReferenceParm)
	TArray<class FText>                           K2Node_MakeArray_Array_1;                          // 0x1AD8(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   Temp_text_Variable_277;                            // 0x1AE8(0x0018)()
	class FText                                   Temp_text_Variable_278;                            // 0x1B00(0x0018)()
	class UFortUIManagerWidget_NUI*               CallFunc_GetUIManagerWidget_ReturnValue;           // 0x1B18(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class FText                                   K2Node_Select_Default_2;                           // 0x1B20(0x0018)()
	class UUserWidget*                            CallFunc_GetCachedWidget_ReturnValue;              // 0x1B38(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FFormatArgumentData                    K2Node_MakeStruct_FormatArgumentData_2;            // 0x1B40(0x0040)(HasGetValueTypeHash)
	class UModalTutorialOverlay_C*                K2Node_DynamicCast_AsModal_Tutorial_Overlay;       // 0x1B80(0x0008)(ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_DynamicCast_bSuccess;                       // 0x1B88(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1B89[0x7];                                     // 0x1B89(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	TArray<struct FFormatArgumentData>            K2Node_MakeArray_Array_2;                          // 0x1B90(0x0010)(ZeroConstructor, ReferenceParm)
	class FText                                   CallFunc_Format_ReturnValue;                       // 0x1BA0(0x0018)()
	TArray<class FText>                           K2Node_MakeArray_Array_3;                          // 0x1BB8(0x0010)(ZeroConstructor, ReferenceParm)
	bool                                          CallFunc_CheckForSideTutorialQuests_RelevantSideQuestFound; // 0x1BC8(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x1BC9(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ItemInspectScreen.ItemInspectScreen_C.CheckForSideTutorialQuests
// 0x0058 (0x0058 - 0x0000)
struct ItemInspectScreen_C_CheckForSideTutorialQuests final
{
public:
	bool                                          RelevantSideQuestFound;                            // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue;                  // 0x0001(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2[0x6];                                        // 0x0002(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortGlobalUIContext*                   CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue;          // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_1;                    // 0x002A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue;            // 0x002B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_1;        // 0x002C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_1;                // 0x002D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_EqualEqual_ByteByte_ReturnValue_2;        // 0x002E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue;                   // 0x002F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue_1;     // 0x0030(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_1;                 // 0x0038(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_2;                    // 0x0039(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue_1;          // 0x003A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_3;                    // 0x003B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_2;                // 0x003C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_3D[0x3];                                       // 0x003D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue_2;     // 0x0040(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_BooleanAND_ReturnValue_2;                 // 0x0048(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_4;                    // 0x0049(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_3;                 // 0x004A(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_5;                    // 0x004B(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_HasCompletedQuest_ReturnValue_2;          // 0x004C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue_6;                    // 0x004D(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_Not_PreBool_ReturnValue_3;                // 0x004E(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_4;                 // 0x004F(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_5;                 // 0x0050(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_BooleanAND_ReturnValue_6;                 // 0x0051(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ItemInspectScreen.ItemInspectScreen_C.AlterationQuestComplete
// 0x0018 (0x0018 - 0x0000)
struct ItemInspectScreen_C_AlterationQuestComplete final
{
public:
	bool                                          QuestComplete;                                     // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortInventoryContext*                  CallFunc_GetContext_ReturnValue;                   // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	int32                                         CallFunc_GetTotalItemQuantityByDefinition_ReturnValue; // 0x0010(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          CallFunc_GreaterEqual_IntInt_ReturnValue;          // 0x0014(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
};

// Function ItemInspectScreen.ItemInspectScreen_C.UpgradeQuestComplete
// 0x0060 (0x0060 - 0x0000)
struct ItemInspectScreen_C_UpgradeQuestComplete final
{
public:
	bool                                          QuestIsComplete;                                   // 0x0000(0x0001)(Parm, OutParm, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1[0x7];                                        // 0x0001(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortGlobalUIContext*                   CallFunc_GetLocalPlayerSubsystem_ReturnValue;      // 0x0008(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UFortQuestManager*                      CallFunc_GetQuestManager_ReturnValue;              // 0x0010(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	EFortItemType                                 CallFunc_GetType_ReturnValue;                      // 0x0018(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_19[0x7];                                       // 0x0019(0x0007)(Fixing Size After Last Property [ Dumper-8 ])
	class UFortQuestItem*                         CallFunc_GetQuestWithDefinition_ReturnValue;       // 0x0020(0x0008)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          K2Node_SwitchEnum_CmpSuccess;                      // 0x0028(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          CallFunc_IsValid_ReturnValue;                      // 0x0029(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_2A[0x6];                                       // 0x002A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
