#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: LeaveButton

#include "Basic.hpp"

#include "FortniteGame_structs.hpp"
#include "Engine_structs.hpp"
#include "CommonUI_classes.hpp"


namespace SDK
{

// WidgetBlueprintGeneratedClass LeaveButton.LeaveButton_C
// 0x00F8 (0x0330 - 0x0238)
class ULeaveButton_C final : public UCommonUserWidget
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0238(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UIconTextButton_C*                      Leave;                                             // 0x0240(0x0008)(BlueprintVisible, ExportObject, ZeroConstructor, InstancedReference, IsPlainOldData, RepSkip, NoDestructor, PersistentInstance, HasGetValueTypeHash)
	TMulticastInlineDelegate<void()>              OnClicked;                                         // 0x0248(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	TMulticastInlineDelegate<void(bool Visibility)> Update_Visibility;                               // 0x0258(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	class UClass*                                 ButtonStyleOverride;                               // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UClass*                                 ControllerStyleOverride;                           // 0x0270(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	bool                                          UseButtoneStyleOverride;                           // 0x0278(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	bool                                          OverrideButtonText;                                // 0x0279(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, ExposeOnSpawn)
	uint8                                         Pad_27A[0x6];                                      // 0x027A(0x0006)(Fixing Size After Last Property [ Dumper-8 ])
	class FText                                   ButtonTextOverride;                                // 0x0280(0x0018)(Edit, BlueprintVisible, ExposeOnSpawn)
	class FText                                   HordModeLeaveDescription;                          // 0x0298(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MissionLeaveDescriptionAlone;                      // 0x02B0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   MissionLeaveDescriptionParty;                      // 0x02C8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StormshieldLeaveDescriptionAlone;                  // 0x02E0(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StormshieldLeaveDescriptionParty;                  // 0x02F8(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class FText                                   StormshieldLeaveTitle;                             // 0x0310(0x0018)(Edit, BlueprintVisible, DisableEditOnInstance)
	class ULeaveDialog_C*                         LeaveDialog;                                       // 0x0328(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_LeaveButton(int32 EntryPoint);
	void HandleLobbyEvents();
	void HandleCanceled();
	void HandleTeamMemberAdded(const struct FFortTeamMemberInfo& NewTeamMemberInfo);
	void Construct();
	void HandleLeft();
	void HandlePlayerStateChanged(const struct FFortTeamMemberInfo& TeamMemberInfo);
	void HandleTeamMemberRemoved(int32 PlayerIndex);
	void PreConstruct(bool IsDesignTime);
	void Destruct();
	void BndEvt__Leave_K2Node_ComponentBoundEvent_90_CommonButtonClicked__DelegateSignature(class UCommonButton* Button);
	void DialogResult_574CB01D47DE8AEDA0EB2F9CFB146A3B(EFortDialogResult Result, class FName ResultName);
	void DialogResult_F5AF58094777CFEEC0BF28BEA620800C(EFortDialogResult Result, class FName ResultName);
	void GetLeaveActionText(class FText* Text);
	void IsConsideredInGame(bool* InGame);
	void UpdateState();
	void LeaveParty();
	void HasUnsavedQuestProgress(bool* HasUnsavedQuestProgress_0);
	void GetButton(class UIconTextButton_C** Leave_0);
	void SetText(const class FText& TextOverride);
	void Update_Style_State();
	void IsInNeighborhood(bool* bIsInNeighborhood);
	void GetDescriptionText(class FText* DescriptionText);
	void Change_Main_Menu_Music_State(bool Set_Lobby_Music_State);
	void GetBRConfirmationDialogText(class FText* TitleText, class FText* MessagText);
	void GetSTWConfirmationDialogText(bool bIsInNeighborhood, class FText* OutTitle, class FText* OutDescription, bool* bOutIsInParty);
	void GetSTWOutpostConfirmationDialogText(class FText* OutTitle, class FText* OutDescription);
	void BindDelegates();
	void UnbindDelegates();
	void ShowLeaveScreen();
	void ClearLeaveDialogDelegate();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"LeaveButton_C">();
	}
	static class ULeaveButton_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<ULeaveButton_C>();
	}
};

}

