#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: M_Med_Soldier_03_Cupid_AnimBlueprint

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass M_Med_Soldier_03_Cupid_AnimBlueprint.M_Med_Soldier_03_Cupid_AnimBlueprint_C
// 0x0E70 (0x1240 - 0x03D0)
class UM_Med_Soldier_03_Cupid_AnimBlueprint_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_1AE2FEE843862DB0926247ABCDEDD974; // 0x03D8(0x0138)(ContainsInstancedReference)
	struct FAnimNode_Root                         AnimGraphNode_Root_91EDDABE45FF40660C7C398C88D576B7; // 0x0510(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_C02AB20348B2B54CFA0C50803C42321A; // 0x0530(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_308ADA1248ABA3187DFA7ABFC12BC130; // 0x0550(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_02B303FA4DDA5584C595D48F2A2D11D1; // 0x0570(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_B17F58154A349B54BB143CBE152F66E8; // 0x09B0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4ABFB15A48A29BF94F74F6BBBF5874AF; // 0x0DF0(0x0440)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x1230(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_M_Med_Soldier_03_Cupid_AnimBlueprint(int32 EntryPoint);
	void BlueprintInitializeAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"M_Med_Soldier_03_Cupid_AnimBlueprint_C">();
	}
	static class UM_Med_Soldier_03_Cupid_AnimBlueprint_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UM_Med_Soldier_03_Cupid_AnimBlueprint_C>();
	}
};

}

