#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: MenuScreen_Athena

#include "Basic.hpp"

#include "AnimGraphRuntime_structs.hpp"
#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "LiveLink_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass MenuScreen_Athena.MenuScreen_Athena_C
// 0x1078 (0x1378 - 0x0300)
class UMenuScreen_Athena_C final : public UFrontendAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0300(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_BC9F551249E266FA43BC349FC345F1FC; // 0x0308(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_CFAAC90A46FD25342F35449196AB843E; // 0x0328(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_2D7030A140A7B9E5EEB43E92FB2BC715; // 0x0348(0x0020)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_DB45EF5942BB99048E7C2C8416282A57; // 0x0368(0x0048)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_38DE62F34079A9ED5E5B85BBCBAD2C22; // 0x03B0(0x00B0)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_233187314408126920AC14A42BA98CE8; // 0x0460(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_D368A9B74AE8F039DA6720801BDD62D5; // 0x04D8(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_653C5A294667E7945D69729979692D20; // 0x0550(0x0078)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_DF33F517431A2AB6E430309E29277E98; // 0x05C8(0x0078)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_6443F71D474774C8ECFB2A9F1ACC1D7A; // 0x0640(0x00A0)()
	struct FAnimNode_BlendListByInt               AnimGraphNode_BlendListByInt_287AF5964C1BE390191EF89CB53D768D; // 0x06E0(0x00A0)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_3BACE47B4A5EF86B449B81BE7045ADA2; // 0x0780(0x00F8)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_AE51F624415A5BC37D7F2FABCBE3FBE1; // 0x0878(0x0108)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_7340818D479943947A1DCCA16CFCAD54; // 0x0980(0x0048)()
	struct FAnimNode_LayeredBoneBlend             AnimGraphNode_LayeredBoneBlend_8D2B60D44BBADFD01AC9A6BF39472D0B; // 0x09C8(0x00B8)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_E3A91A3649B6A1ABC9AC3B97A7AF4134; // 0x0A80(0x00B8)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_93498E3D45EEA3CEA9E5EA88BB757C3B; // 0x0B38(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_F237E66D4F1546A501C2548E2EB67224; // 0x0B60(0x0028)()
	struct FAnimNode_LegIK                        AnimGraphNode_LegIK_FCD7422A4E3CE397C446C0A397266FEA; // 0x0B88(0x00F8)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_4C554C3D4E078CDC75B08E9CEF8DED1C; // 0x0C80(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_0A8F4F2D443AA18F68E37A8C2921091A; // 0x0D70(0x00F0)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_E5DB5C2C4C7A35E4ACBEDD9FA10C6F14; // 0x0E60(0x00F0)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_DEF974814E7973E5101173AC4D7EB0D8; // 0x0F50(0x0048)()
	struct FAnimNode_Slot                         AnimGraphNode_Slot_956C68EE47FB10F868DA9DA5EE1D9DF0; // 0x0F98(0x0048)()
	struct FAnimNode_CopyBone                     AnimGraphNode_CopyBone_6327A1A14DE55AB303900EA4F6D3F26C; // 0x0FE0(0x00F0)()
	struct FAnimNode_SaveCachedPose               AnimGraphNode_SaveCachedPose_969E8D9248BAE190CFD2FD839FB0B147; // 0x10D0(0x00B8)()
	struct FAnimNode_LiveLinkPose                 AnimGraphNode_LiveLinkPose_0D475B2341B406FEF0BCA585E7826551; // 0x1188(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_F4B6CF9B49E859B8567727981750F9B4; // 0x11D0(0x0028)()
	struct FAnimNode_BlendListByEnum              AnimGraphNode_BlendListByEnum_664DEC0940CE3732CE6543AFEC9586D3; // 0x11F8(0x00B0)()
	struct FAnimNode_LiveLinkPose                 AnimGraphNode_LiveLinkPose_0829704A48F862E21996E0A709B5ABE2; // 0x12A8(0x0048)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_9061771D488DBC6B5B382291227784C5; // 0x12F0(0x0028)()
	struct FAnimNode_UseCachedPose                AnimGraphNode_UseCachedPose_C5D5A3754658C2629911E0B961515E7E; // 0x1318(0x0028)()
	TMulticastInlineDelegate<void()>              MenuScreenDispatcher;                              // 0x1340(0x0010)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, BlueprintAssignable, BlueprintCallable)
	bool                                          HasBeenSelected;                                   // 0x1350(0x0001)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor)
	uint8                                         Pad_1351[0x3];                                     // 0x1351(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	int32                                         PoseInt;                                           // 0x1354(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                OffsetTranslate;                                   // 0x1358(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               OffsetRotate;                                      // 0x1364(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	class APlayerPawn_Athena_C*                   PawnOwner;                                         // 0x1370(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_MenuScreen_Athena(int32 EntryPoint);
	void AnimNotify_LobbySkydive_Gliding();
	void AnimNotify_LobbySkydive_Diving();
	void BlueprintInitializeAnimation();
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void AnimNotify_LeftB();
	void AnimNotify_playFacialAnim();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_MenuScreen_Athena_AnimGraphNode_LayeredBoneBlend_8D2B60D44BBADFD01AC9A6BF39472D0B();
	void UserFocus();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"MenuScreen_Athena_C">();
	}
	static class UMenuScreen_Athena_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<UMenuScreen_Athena_C>();
	}
};

}

