#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SK_F_LRG_Constructor_01_Skeleton_AnimBP

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_F_LRG_Constructor_01_Skeleton_AnimBP.SK_F_LRG_Constructor_01_Skeleton_AnimBP_C
// 0x3D30 (0x4100 - 0x03D0)
class USK_F_LRG_Constructor_01_Skeleton_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_BBB13A1043E829C1CC58D9A49D49F566; // 0x03D8(0x0020)()
	struct FAnimNode_CopyPoseFromMesh             AnimGraphNode_CopyPoseFromMesh_A0A7862C41D58A2D7BA59DB29DC489F6; // 0x03F8(0x0138)(ContainsInstancedReference)
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_A14060684EA36E6A38C64C9CC3B1D9AB; // 0x0530(0x0440)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_DAA1FFE44162B99482DFA5B4159C7405; // 0x0970(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_ECD817444DCDA9467A6F8BBBF6A2EFA0; // 0x0990(0x0020)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_CB3D6B164B59E44D18B490B3841357B8; // 0x09B0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_F74199DA4EA69D7DDF67BCADDD574900; // 0x0DF0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_DA9E260A4D1351ED0E17E58B79953B20; // 0x1230(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_EAC240C941C5FF15BA213E8AAE7D17F3; // 0x1670(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_CF18CD1F453F70B994906BAD08D8FE6B; // 0x1AB0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_CD1FE29D46CD2DE2B656CC945C67F8FE; // 0x1EF0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_92E1B7D74567C03375E012B851D8CD81; // 0x2330(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_DBA4FC8449C310563A81A095EE9AC303; // 0x2770(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_4858A3D249AA3874A2388D912273B290; // 0x2BB0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_42944FB54D814E3C274720A692DF63CA; // 0x2FF0(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_31F5F26747E828356CE78D849F177EEB; // 0x3430(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_6057D72E42852A339E4F66840D894B6D; // 0x3870(0x0440)()
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_B6385FE84A87BF3442422786D1AB2689; // 0x3CB0(0x0440)()
	class USkeletalMeshComponent*                 MeshToCopy;                                        // 0x40F0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         HammerDynamicsOK;                                  // 0x40F8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_SK_F_LRG_Constructor_01_Skeleton_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_F_LRG_Constructor_01_Skeleton_AnimBP_AnimGraphNode_AnimDynamics_A14060684EA36E6A38C64C9CC3B1D9AB();
	void EvaluateGraphExposedInputs_ExecuteUbergraph_SK_F_LRG_Constructor_01_Skeleton_AnimBP_AnimGraphNode_AnimDynamics_B6385FE84A87BF3442422786D1AB2689();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_F_LRG_Constructor_01_Skeleton_AnimBP_C">();
	}
	static class USK_F_LRG_Constructor_01_Skeleton_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_F_LRG_Constructor_01_Skeleton_AnimBP_C>();
	}
};

}

