#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SK_Pickaxe_Lion_AnimBP

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_Pickaxe_Lion_AnimBP.SK_Pickaxe_Lion_AnimBP_C
// 0x0708 (0x0970 - 0x0268)
class USK_Pickaxe_Lion_AnimBP_C final : public UAnimInstance
{
public:
	uint8                                         Pad_268[0x8];                                      // 0x0268(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0270(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	struct FAnimNode_Root                         AnimGraphNode_Root_8D50838C44AF9D1DE0E0F0B928CFDF98; // 0x0278(0x0020)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_26C0AA3848EED348489A2C9D58E901BA; // 0x0298(0x0020)()
	struct FAnimNode_SequencePlayer               AnimGraphNode_SequencePlayer_F885D8BE4E41E0AC4C2F1F986B927309; // 0x02B8(0x0078)()
	struct FAnimNode_StateResult                  AnimGraphNode_StateResult_E4F1A1A44E5CBA797024FABEB0F302C0; // 0x0330(0x0020)()
	struct FAnimNode_StateMachine                 AnimGraphNode_StateMachine_57AEDF414DB4EB76A7EAFBBC9D155BF7; // 0x0350(0x00B0)()
	struct FAnimNode_RigidBody                    AnimGraphNode_RigidBody_A5DA35424AD2DC86A0C279B34E798B69; // 0x0400(0x0550)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_09E7BBE9430017596BDF528EDCCD741A; // 0x0950(0x0020)()

public:
	void ExecuteUbergraph_SK_Pickaxe_Lion_AnimBP(int32 EntryPoint);

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_Pickaxe_Lion_AnimBP_C">();
	}
	static class USK_Pickaxe_Lion_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_Pickaxe_Lion_AnimBP_C>();
	}
};

}

