#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: SK_Weapon_Floatation_Balloon_BackKnot_Dyn_AnimBP

#include "Basic.hpp"

#include "FortniteGame_classes.hpp"
#include "Engine_structs.hpp"
#include "CoreUObject_structs.hpp"
#include "AnimGraphRuntime_structs.hpp"


namespace SDK
{

// AnimBlueprintGeneratedClass SK_Weapon_Floatation_Balloon_BackKnot_Dyn_AnimBP.SK_Weapon_Floatation_Balloon_BackKnot_Dyn_AnimBP_C
// 0x0720 (0x0AF0 - 0x03D0)
class USK_Weapon_Floatation_Balloon_BackKnot_Dyn_AnimBP_C final : public UCustomCharacterPartAnimInstance
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x03D0(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	uint8                                         Pad_3D8[0x8];                                      // 0x03D8(0x0008)(Fixing Size After Last Property [ Dumper-8 ])
	struct FAnimNode_AnimDynamics                 AnimGraphNode_AnimDynamics_69B159AC4A6199E0C4FDFB8635E75D79; // 0x03E0(0x0440)()
	struct FAnimNode_RefPose                      AnimGraphNode_LocalRefPose_FDE8994F4D210D08EDA033A9D3E81672; // 0x0820(0x0018)()
	struct FAnimNode_ConvertLocalToComponentSpace AnimGraphNode_LocalToComponentSpace_D4D14D74402362E8B12523B0977EF778; // 0x0838(0x0020)()
	struct FAnimNode_ConvertComponentToLocalSpace AnimGraphNode_ComponentToLocalSpace_A4EDA2894BF1E7CE3BF214AFF3DC2ED6; // 0x0858(0x0020)()
	struct FAnimNode_Root                         AnimGraphNode_Root_3C1BB7DE4FD6FF67836FAE9ACCF37460; // 0x0878(0x0020)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_C7700CCB48C6B72B53BABDB1A8E11F3F; // 0x0898(0x0108)()
	struct FAnimNode_ModifyBone                   AnimGraphNode_ModifyBone_2E06B5DB4589D39F49B61FB14C0B1BFB; // 0x09A0(0x0108)()
	struct FRotator                               socketUpVector;                                    // 0x0AA8(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)
	uint8                                         Pad_AB4[0x4];                                      // 0x0AB4(0x0004)(Fixing Size After Last Property [ Dumper-8 ])
	class ACharacter*                             Character;                                         // 0x0AB8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class AFortPlayerPawnAthena*                  player_pawn;                                       // 0x0AC0(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	float                                         pawn_speed_alpha;                                  // 0x0AC8(0x0004)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FVector                                backpack_position;                                 // 0x0ACC(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class ABGA_Athena_Balloons_C*                 BGA_Athena_Balloons;                               // 0x0AD8(0x0008)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnTemplate, DisableEditOnInstance, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	struct FRotator                               backpack_rotation;                                 // 0x0AE0(0x000C)(Edit, BlueprintVisible, ZeroConstructor, DisableEditOnInstance, IsPlainOldData, NoDestructor)

public:
	void ExecuteUbergraph_SK_Weapon_Floatation_Balloon_BackKnot_Dyn_AnimBP(int32 EntryPoint);
	void BlueprintUpdateAnimation(float DeltaTimeX);
	void BlueprintInitializeAnimation();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"SK_Weapon_Floatation_Balloon_BackKnot_Dyn_AnimBP_C">();
	}
	static class USK_Weapon_Floatation_Balloon_BackKnot_Dyn_AnimBP_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<USK_Weapon_Floatation_Balloon_BackKnot_Dyn_AnimBP_C>();
	}
};

}

