#pragma once

/*
* SDK generated by Dumper-8
*
* https://github.com/NotTacs/Dumper-8
*/

// Package: UpgradeMonitor

#include "Basic.hpp"

#include "Engine_structs.hpp"
#include "Engine_classes.hpp"


namespace SDK
{

// BlueprintGeneratedClass UpgradeMonitor.UpgradeMonitor_C
// 0x0030 (0x0270 - 0x0240)
class AUpgradeMonitor_C final : public AActor
{
public:
	struct FPointerToUberGraphFrame               UberGraphFrame;                                    // 0x0240(0x0008)(ZeroConstructor, Transient, DuplicateTransient)
	class UStaticMeshComponent*                   SM_Monitor;                                        // 0x0248(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	class USceneComponent*                        DefaultSceneRoot;                                  // 0x0250(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NonTransactional, NoDestructor, HasGetValueTypeHash)
	float                                         IconTransition_NoiseTrack_91F32E2D4993BD4F612A23BFAFACADE0; // 0x0258(0x0004)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	ETimelineDirection                            IconTransition__Direction_91F32E2D4993BD4F612A23BFAFACADE0; // 0x025C(0x0001)(ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	uint8                                         Pad_25D[0x3];                                      // 0x025D(0x0003)(Fixing Size After Last Property [ Dumper-8 ])
	class UTimelineComponent*                     IconTransition;                                    // 0x0260(0x0008)(BlueprintVisible, ZeroConstructor, InstancedReference, IsPlainOldData, NoDestructor, HasGetValueTypeHash)
	class UMaterialInstanceDynamic*               MID_MonitorScreen;                                 // 0x0268(0x0008)(Edit, BlueprintVisible, ZeroConstructor, IsPlainOldData, NoDestructor, HasGetValueTypeHash)

public:
	void ExecuteUbergraph_UpgradeMonitor(int32 EntryPoint);
	void Activate_Gadgets();
	void Activate_Utilities();
	void Activation_Distortion();
	void IconTransition__FinishedFunc();
	void IconTransition__UpdateFunc();
	void SetMonitorDistort();
	void SetUtilities_Icon(class UTexture2D* Active_Icon);
	void UserConstructionScript();

public:
	static class UClass* StaticClass()
	{
		return StaticBPGeneratedClassImpl<"UpgradeMonitor_C">();
	}
	static class AUpgradeMonitor_C* GetDefaultObj()
	{
		return GetDefaultObjImpl<AUpgradeMonitor_C>();
	}
};

}

